[
	{
		"title": "Ln: A simple, extensible static site generator",
		"date": "2018-06-11 16:21",
		"fdate": "2018-06-11T10:51:00.000Z",
		"pdate": "2018-06-11",
		"author": "Angad Singh",
		"filename": "2018-06-11-ln-static-gen.html",
		"content": "\n<p>I've started building a lot more projects. I wanted to write about problems I ran into, tools I used and just general stuff. I've tried a lot of ways to blog, and pretty much none of them fit into my workflow. <a href=\"https://jekyllrb.com\">Jekyll</a> felt overkill, I don't know React so <a href=\"https://gatsbyjs.com\">Gatsby</a> or anything React based was not an option. I'm not great at Python, so most of the Python-based options were out too. I also wanted a nice weekend project to work on after my SSAT was over.</p>\n\n<p>Writing my own generator was fun. It wasn't very difficult, but challenging enough to keep me interested. I wrote Ln in JavaScript, because I know JavaScript well enough to write usable software.</p>\n\n<p><a href=\"https://github.com/angad19/ln\">Ln</a> is a simple and extensible static site generator. It is made up of three components - <code>posts.json</code>, plugins and <code>config.js</code>. <code>posts.json</code> is a JSON file which contains an array of post objects. <code>posts.json</code> is read and an array of post objects is created. An ln plugin is just a function that takes an array of post objects and the config as params and returns a promise which resolves with an array of posts. So, for example, you could build a plugin that reads all org files in a directory, generates post objects from them and adds them to the posts array. After <code>awaiting</code> all the plugins, the modified array of post objects is written to <code>posts.json</code>. <code>config.js</code> exports an object whose properties can be accessed by all plugins.</p>\n\n<p>You can then run the index script to run the build function which calls all the plugins.</p>\n\n<p><a href=\"https://github.com/angad19/ln\">Check the project out on Github!</a></p>\n"
	}
]